Revit 2027 API
StructuralSectionConcreteCross.CantileverHeight Property
 Flange cantilever thickness.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CantileverHeight { get; set; }
Public Property CantileverHeight As Double
	Get
	Set
public:
property double CantileverHeight {
	double get ();
	void set (double value);
}
member CantileverHeight : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionConcreteCross Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace